УНФ_ТЕСТ/src/ExchangePlans/ОбменУправлениеНебольшойФирмойСайт/ОбменУправлениеНебольшойФирмойСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="ac05330e-74a6-489e-bfa1-cefa8610daff">
  <name>ОбменУправлениеНебольшойФирмойСайт</name>
  <attributes>
    <name>АдресСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>CatalogRef.ВидыЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенУслуг</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьДнейГрафика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьКартинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстаткиПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьПолнуюВыгрузкуПринудительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляНовойНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляНовыхКонтрагентов</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаДляНовыхКонтрагентов</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыгрузкиЗаказов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКаталогаУслуг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗаданияПечатьЧеков</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДляПодстановкиВЗаказы</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиВыгрузкиДопРеквизитовЗаказов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиВыгрузкиОстатковПоставщиковНаСайт</name>
    <type>
      <types>CatalogRef.НастройкиВыгрузкиОстатковПоставщиковНаСайт</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиВыгрузкиРеквизитов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиПоискаКонтрагентов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЗаказами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЗаписьНаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменТоварами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьТолькоНеПроведенныеЗаказыПриЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОнлайнОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДляПодстановкиВЗаказы</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборГруппыКатегорииНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыОтборовНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходURLАдминЗоны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходАдресСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробиватьЧекиПоОнлайнОплатам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколОбменаCMS</name>
    <type>
      <types>EnumRef.ПротоколыОбменаCMS</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПорции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиЦен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладДляПодстановкиВЗаказы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказНаряда</name>
    <type>
      <types>CatalogRef.СостоянияЗаказНарядов</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяТаблицаКаталогов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособИдентификацииКонтрагентов</name>
    <type>
      <types>EnumRef.СпособыИдентификацииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиДатыОтгрузкиЗаказа</name>
    <type>
      <types>EnumRef.СпособыУстановкиДатыОтгрузкиЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиДатыОтгрузкиЗаказаКоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСохраненнаяТаблицаУслуг</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНоменклатурыДляВыгрузки</name>
    <comment>0 - Наименование, 1 - Полное наименование</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеСтатусовЗаказов</name>
    <attributes>
      <name>ИДСтатусаЗаказаНаСайте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказаНаСайте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаказаПокупателя</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>РезервироватьТовар</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладРезерв</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеВидовОплат</name>
    <attributes>
      <name>ИдСпособаОплатыНаСайте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОплатыНаСайте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплатыНаСайте</name>
      <type>
        <types>EnumRef.ТипыОплатНаСайте</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаОплаты</name>
      <type>
        <types>CatalogRef.КассыККМ</types>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
        <types>CatalogRef.Кассы</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеСлужбДоставки</name>
    <attributes>
      <name>ИдСлужбыДоставкиНаСайте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлужбаДоставкиНаСайте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлужбаДоставки</name>
      <type>
        <types>CatalogRef.СлужбыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктураКаталога</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеПолейНоменклатуры</name>
    <attributes>
      <name>ПолеНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоля1С</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоляXML</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

УНФ_ТЕСТ/src/ExchangePlans/ОбменУправлениеНебольшойФирмойСайт/Forms/ФормаВыбораРеквизитов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкиВыгрузкиРеквизитов") Тогда
		ЗаполнитьСписокРеквизитов(Параметры.НастройкиВыгрузкиРеквизитов);
	ИначеЕсли Параметры.Свойство("НастройкиВыгрузкиДопРеквизитовЗаказов") Тогда
		ЗаполнитьСписокДопРеквизитовЗаказов(Параметры.НастройкиВыгрузкиДопРеквизитовЗаказов, Параметры.ЗаказПокупателя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВыбранныеРеквизиты = Новый Структура;
	
	Для каждого реквизит Из СписокРеквизитов Цикл
		
		Если реквизит.Пометка Тогда
			ВыбранныеРеквизиты.Вставить(реквизит.Значение, реквизит.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(ВыбранныеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьСписокДопРеквизитовЗаказов(ТекущиеНастройки, ВладелецСвойств)
	
	Если ЗначениеЗаполнено(ТекущиеНастройки) Тогда
		СоответствиеВыбранныхРеквизитов = ОбменССайтом.ЧтениеJSONВСтруктуру(ТекущиеНастройки, Истина);
	Иначе
		СоответствиеВыбранныхРеквизитов = Новый Соответствие;
	КонецЕсли;
	
	ТаблицаСвойств = УправлениеСвойствамиСлужебный.СписокСвойствДляВидаОбъектов("Документ_ЗаказПокупателя", "ДополнительныеРеквизиты");
	Для каждого ДопРеквизит Из ТаблицаСвойств Цикл
		
		СвойстваРеквизитаСписка = Неопределено;
		ИмяРеквизита = ДопРеквизит.Свойство.ИдентификаторДляФормул;
		НаименованиеДляВыгрузки = СоответствиеВыбранныхРеквизитов.Получить(ИмяРеквизита);
		
		НовСтр = СписокРеквизитов.Добавить();
		НовСтр.Значение = ИмяРеквизита;
		
		Если НаименованиеДляВыгрузки = Неопределено Тогда
			НовСтр.Представление = ДопРеквизит.Наименование;
			НовСтр.Пометка = Ложь;
		Иначе
			НовСтр.Представление = НаименованиеДляВыгрузки;
			НовСтр.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	СортироватьПоПометке();
	
КонецФункции

&НаСервере
Функция ЗаполнитьСписокРеквизитов(ТекущиеНастройки)
	
	Если ЗначениеЗаполнено(ТекущиеНастройки) Тогда
		СписокВыбранныхРеквизитов = ОбменССайтом.ЧтениеJSONВСтруктуру(ТекущиеНастройки, Ложь);
	Иначе
		СписокВыбранныхРеквизитов = Новый Структура;
	КонецЕсли;
	
	Для каждого реквизит Из Метаданные.Справочники.Номенклатура.Реквизиты Цикл
		
		СвойстваРеквизитаСписка = Неопределено;
		ЕстьРеквизит = СписокВыбранныхРеквизитов.Свойство(реквизит.Имя, СвойстваРеквизитаСписка);
		
		НовСтр = СписокРеквизитов.Добавить();
		НовСтр.Значение = реквизит.Имя;
		Если ЕстьРеквизит Тогда
			НовСтр.Представление = ?(ЗначениеЗаполнено(СвойстваРеквизитаСписка), СвойстваРеквизитаСписка, реквизит.Имя);
			НовСтр.Пометка = Истина;
		Иначе
			НовСтр.Представление = реквизит.Имя;
			НовСтр.Пометка = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	СортироватьПоПометке();
	
КонецФункции

&НаКлиенте
Процедура СписокРеквизитовПриИзменении(Элемент)
	
	СортироватьПоПометке();
	
КонецПроцедуры

&НаСервере
Процедура СортироватьПоПометке()
	
	ТЗРеквизитов = РеквизитФормыВЗначение("СписокРеквизитов");
	ТЗРеквизитов.Сортировать("Пометка Убыв, Значение Возр");
	
	ЗначениеВРеквизитФормы(ТЗРеквизитов, "СписокРеквизитов");
	
КонецПроцедуры

#КонецОбласти
